// Задача 2: Напишите программу, которая на вход принимает два числа
// и выдаёт, какое число большее, а какое меньшее.

Console.WriteLine("Введите первое число:"); // Консоль выводит "Введите первое число"

Console.WriteLine("Введите второе число:"); // Консоль выводит "Введите второе число"
